99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_watch.c
#include "esp32_mquickjs_wifi.h"
#include "esp32_mquickjs_memory.h"
#include "esp32_mquickjs_memory_rtos.h"
#include "esp32_mquickjs_wifi_neighbor.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_options.h"
#include "esp_heap_caps.h"
#include "esp_wifi_he_types.h"
#include <math.h>
#include <stdio.h>
#include <string.h>

/* All stored payloads are explicit value copies. SDK pointers/padding/secrets
 * never enter ingress or subscriber queues. */
typedef enum {
    WATCH_EMPTY, WATCH_UNREVIEWED, WATCH_SENSITIVE, WATCH_SCAN,
    WATCH_CONNECTED, WATCH_DISCONNECTED, WATCH_AUTH, WATCH_AP_CONNECTED,
    WATCH_AP_DISCONNECTED, WATCH_PROBE, WATCH_RSSI, WATCH_CHANNEL,
    WATCH_FTM, WATCH_ACTION, WATCH_ROC, WATCH_WRONG_PASSWORD, WATCH_BEACON_OFFSET,
    WATCH_ITWT_SETUP, WATCH_BTWT_SETUP, WATCH_ITWT_TEARDOWN, WATCH_BTWT_TEARDOWN,
    WATCH_ITWT_PROBE, WATCH_ITWT_SUSPEND, WATCH_TWT_WAKEUP, WATCH_NEIGHBOR,
} wifi_watch_kind_t;
typedef struct { int32_t id; const char *name, *category; wifi_watch_kind_t kind; } wifi_watch_descriptor_t;
static const wifi_watch_descriptor_t s_descriptors[] = {
    {WIFI_EVENT_WIFI_READY, "WIFI_EVENT_WIFI_READY", "radio", WATCH_EMPTY},
    {WIFI_EVENT_SCAN_DONE, "WIFI_EVENT_SCAN_DONE", "scan", WATCH_SCAN},
    {WIFI_EVENT_STA_START, "WIFI_EVENT_STA_START", "station", WATCH_EMPTY},
    {WIFI_EVENT_STA_STOP, "WIFI_EVENT_STA_STOP", "station", WATCH_EMPTY},
    {WIFI_EVENT_STA_CONNECTED, "WIFI_EVENT_STA_CONNECTED", "station", WATCH_CONNECTED},
    {WIFI_EVENT_STA_DISCONNECTED, "WIFI_EVENT_STA_DISCONNECTED", "station", WATCH_DISCONNECTED},
    {WIFI_EVENT_STA_AUTHMODE_CHANGE, "WIFI_EVENT_STA_AUTHMODE_CHANGE", "station", WATCH_AUTH},
    {WIFI_EVENT_STA_WPS_ER_SUCCESS, "WIFI_EVENT_STA_WPS_ER_SUCCESS", "wps", WATCH_SENSITIVE},
    {WIFI_EVENT_STA_WPS_ER_FAILED, "WIFI_EVENT_STA_WPS_ER_FAILED", "wps", WATCH_SENSITIVE},
    {WIFI_EVENT_STA_WPS_ER_TIMEOUT, "WIFI_EVENT_STA_WPS_ER_TIMEOUT", "wps", WATCH_SENSITIVE},
    {WIFI_EVENT_STA_WPS_ER_PIN, "WIFI_EVENT_STA_WPS_ER_PIN", "wps", WATCH_SENSITIVE},
    {WIFI_EVENT_STA_WPS_ER_PBC_OVERLAP, "WIFI_EVENT_STA_WPS_ER_PBC_OVERLAP", "wps", WATCH_SENSITIVE},
    {WIFI_EVENT_AP_START, "WIFI_EVENT_AP_START", "access-point", WATCH_EMPTY},
    {WIFI_EVENT_AP_STOP, "WIFI_EVENT_AP_STOP", "access-point", WATCH_EMPTY},
    {WIFI_EVENT_AP_STACONNECTED, "WIFI_EVENT_AP_STACONNECTED", "access-point", WATCH_AP_CONNECTED},
    {WIFI_EVENT_AP_STADISCONNECTED, "WIFI_EVENT_AP_STADISCONNECTED", "access-point", WATCH_AP_DISCONNECTED},
    {WIFI_EVENT_AP_PROBEREQRECVED, "WIFI_EVENT_AP_PROBEREQRECVED", "access-point", WATCH_PROBE},
    {WIFI_EVENT_FTM_REPORT, "WIFI_EVENT_FTM_REPORT", "ftm", WATCH_FTM},
    {WIFI_EVENT_STA_BSS_RSSI_LOW, "WIFI_EVENT_STA_BSS_RSSI_LOW", "station", WATCH_RSSI},
    {WIFI_EVENT_ACTION_TX_STATUS, "WIFI_EVENT_ACTION_TX_STATUS", "radio", WATCH_ACTION},
    {WIFI_EVENT_ROC_DONE, "WIFI_EVENT_ROC_DONE", "radio", WATCH_ROC},
    {WIFI_EVENT_STA_BEACON_TIMEOUT, "WIFI_EVENT_STA_BEACON_TIMEOUT", "station", WATCH_EMPTY},
    {WIFI_EVENT_CONNECTIONLESS_MODULE_WAKE_INTERVAL_START, "WIFI_EVENT_CONNECTIONLESS_MODULE_WAKE_INTERVAL_START", "radio", WATCH_EMPTY},
    {WIFI_EVENT_AP_WPS_RG_SUCCESS, "WIFI_EVENT_AP_WPS_RG_SUCCESS", "wps", WATCH_SENSITIVE},
    {WIFI_EVENT_AP_WPS_RG_FAILED, "WIFI_EVENT_AP_WPS_RG_FAILED", "wps", WATCH_SENSITIVE},
    {WIFI_EVENT_AP_WPS_RG_TIMEOUT, "WIFI_EVENT_AP_WPS_RG_TIMEOUT", "wps", WATCH_SENSITIVE},
    {WIFI_EVENT_AP_WPS_RG_PIN, "WIFI_EVENT_AP_WPS_RG_PIN", "wps", WATCH_SENSITIVE},
    {WIFI_EVENT_AP_WPS_RG_PBC_OVERLAP, "WIFI_EVENT_AP_WPS_RG_PBC_OVERLAP", "wps", WATCH_SENSITIVE},
    {WIFI_EVENT_ITWT_SETUP, "WIFI_EVENT_ITWT_SETUP", "twt", WATCH_ITWT_SETUP},
    {WIFI_EVENT_ITWT_TEARDOWN, "WIFI_EVENT_ITWT_TEARDOWN", "twt", WATCH_ITWT_TEARDOWN},
    {WIFI_EVENT_ITWT_PROBE, "WIFI_EVENT_ITWT_PROBE", "twt", WATCH_ITWT_PROBE},
    {WIFI_EVENT_ITWT_SUSPEND, "WIFI_EVENT_ITWT_SUSPEND", "twt", WATCH_ITWT_SUSPEND},
    {WIFI_EVENT_TWT_WAKEUP, "WIFI_EVENT_TWT_WAKEUP", "twt", WATCH_TWT_WAKEUP},
    {WIFI_EVENT_BTWT_SETUP, "WIFI_EVENT_BTWT_SETUP", "twt", WATCH_BTWT_SETUP},
    {WIFI_EVENT_BTWT_TEARDOWN, "WIFI_EVENT_BTWT_TEARDOWN", "twt", WATCH_BTWT_TEARDOWN},
    {WIFI_EVENT_NAN_SYNC_STARTED, "WIFI_EVENT_NAN_SYNC_STARTED", "nan", WATCH_SENSITIVE},
    {WIFI_EVENT_NAN_SYNC_STOPPED, "WIFI_EVENT_NAN_SYNC_STOPPED", "nan", WATCH_SENSITIVE},
    {WIFI_EVENT_NAN_SVC_MATCH, "WIFI_EVENT_NAN_SVC_MATCH", "nan", WATCH_SENSITIVE},
    {WIFI_EVENT_NAN_REPLIED, "WIFI_EVENT_NAN_REPLIED", "nan", WATCH_SENSITIVE},
    {WIFI_EVENT_NAN_RECEIVE, "WIFI_EVENT_NAN_RECEIVE", "nan", WATCH_SENSITIVE},
    {WIFI_EVENT_NDP_INDICATION, "WIFI_EVENT_NDP_INDICATION", "nan", WATCH_SENSITIVE},
    {WIFI_EVENT_NDP_CONFIRM, "WIFI_EVENT_NDP_CONFIRM", "nan", WATCH_SENSITIVE},
    {WIFI_EVENT_NDP_TERMINATED, "WIFI_EVENT_NDP_TERMINATED", "nan", WATCH_SENSITIVE},
    {WIFI_EVENT_HOME_CHANNEL_CHANGE, "WIFI_EVENT_HOME_CHANNEL_CHANGE", "radio", WATCH_CHANNEL},
    {WIFI_EVENT_STA_NEIGHBOR_REP, "WIFI_EVENT_STA_NEIGHBOR_REP", "station", WATCH_NEIGHBOR},
    {WIFI_EVENT_AP_WRONG_PASSWORD, "WIFI_EVENT_AP_WRONG_PASSWORD", "access-point", WATCH_WRONG_PASSWORD},
    {WIFI_EVENT_STA_BEACON_OFFSET_UNSTABLE, "WIFI_EVENT_STA_BEACON_OFFSET_UNSTABLE", "station", WATCH_BEACON_OFFSET},
    {WIFI_EVENT_DPP_URI_READY, "WIFI_EVENT_DPP_URI_READY", "dpp", WATCH_SENSITIVE},
    {WIFI_EVENT_DPP_CFG_RECVD, "WIFI_EVENT_DPP_CFG_RECVD", "dpp", WATCH_SENSITIVE},
    {WIFI_EVENT_DPP_FAILED, "WIFI_EVENT_DPP_FAILED", "dpp", WATCH_SENSITIVE},
    {WIFI_EVENT_NAN_PAIRING_INDICATION, "WIFI_EVENT_NAN_PAIRING_INDICATION", "nan", WATCH_SENSITIVE},
    {WIFI_EVENT_NAN_PAIRING_CONFIRM, "WIFI_EVENT_NAN_PAIRING_CONFIRM", "nan", WATCH_SENSITIVE},
    {WIFI_EVENT_NAN_CLUSTER_JOIN, "WIFI_EVENT_NAN_CLUSTER_JOIN", "nan", WATCH_SENSITIVE},
};
_Static_assert(WIFI_EVENT_MAX <= 64, "extend event filter storage before adding IDs");
_Static_assert(sizeof(s_descriptors) / sizeof(s_descriptors[0]) == WIFI_EVENT_MAX,
               "review new SDK Wi-Fi events before publishing them");

/* Reviewed IEEE Neighbor Report fields only; no vendor bytes or SDK pointers. */
typedef esp32_mquickjs_wifi_neighbor_t wifi_watch_neighbor_t;
typedef struct {
    uint32_t refs;
    uint16_t report_length, count, skipped_elements;
    uint8_t dialog_token;
    wifi_watch_neighbor_t neighbors[ESP32_MQUICKJS_WIFI_WATCH_MAX_NEIGHBORS];
} wifi_watch_neighbor_slot_t;
