99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_watch.c
typedef enum {
    WATCH_DATA_OK, WATCH_DATA_INVALID, WATCH_DATA_CAPACITY, WATCH_DATA_TOO_LARGE,
} wifi_watch_data_result_t;

typedef struct {
    uint64_t sequence, timestamp_us;
    int32_t id;
    uint32_t control_generation;
    bool has_data, raw_requested;
    uint8_t data_result;
    union {
        wifi_watch_neighbor_slot_t *neighbor;
        struct {
            uint8_t address[6], ssid[32];
            union { uint8_t ssid_len, count; };
            union {
                struct { int32_t a, b, c, d; };
                uint32_t unsigned_values[4];
                float value;
            };
        };
        struct {
            uint64_t target_wake_time;
            int32_t status, setup_command;
            uint16_t mantissa, twt_id, timeout_ms;
            uint8_t reason, id, exponent, duration, unit, flow_type;
            bool trigger;
        } twt_setup;
        struct {
            int32_t status;
            uint8_t bitmap;
            uint32_t duration_ms[8];
        } twt_suspend;
    };
} wifi_watch_event_t;
typedef struct {
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_event_queue_t *queue;
    uint64_t after_sequence, mask;
    bool all, raw;
} wifi_watch_source_t;

/* One boot-owned mutex and default-loop observer; neither holds a runtime or
 * driver reference. Payload storage is freed when the last subscription closes. */
static StaticSemaphore_t s_watch_mutex_storage;
static _Atomic(SemaphoreHandle_t) s_watch_mutex;
static esp_event_handler_instance_t s_watch_instance;
static QueueHandle_t s_ingress;
static wifi_watch_source_t *s_sources[ESP32_MQUICKJS_WIFI_MAX_WATCHERS];
static uint64_t s_sequence;
static _Atomic uint32_t s_ingress_dropped;
static uint32_t s_ingress_high_water;
#define WIFI_WATCH_MAX_SEQUENCE UINT64_C(9007199254740991)

/* Separate lock: EventQueue drops may run with its send lock held. Never take
 * the watch mutex from a drop, allocate/free under a port critical section, or
 * allow a new pool while the previous pool is still being freed. */
static portMUX_TYPE s_neighbor_mux = portMUX_INITIALIZER_UNLOCKED;
static wifi_watch_neighbor_slot_t *s_neighbor_pool;
static enum { NEIGHBOR_NONE, NEIGHBOR_OPEN, NEIGHBOR_RETIRED, NEIGHBOR_REAPING } s_neighbor_state;
static uint32_t s_neighbor_active;

/* Caller holds the watch mutex, which serializes open and retirement. */
static esp_err_t wifi_watch_neighbor_open(void)
{
    portENTER_CRITICAL(&s_neighbor_mux);
    bool ready = s_neighbor_state == NEIGHBOR_OPEN;
    bool empty = s_neighbor_state == NEIGHBOR_NONE;
    portEXIT_CRITICAL(&s_neighbor_mux);
    if (ready) return ESP_OK;
    if (!empty) return ESP_ERR_INVALID_STATE;
    wifi_watch_neighbor_slot_t *pool = esp32_mquickjs_memory_wireless_calloc("wifi", ESP32_MQUICKJS_WIFI_WATCH_NEIGHBOR_SLOTS, sizeof(*pool), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_POOL);
    if (pool == NULL) return ESP_ERR_NO_MEM;
    portENTER_CRITICAL(&s_neighbor_mux);
    s_neighbor_pool = pool;
    s_neighbor_state = NEIGHBOR_OPEN;
    portEXIT_CRITICAL(&s_neighbor_mux);
    return ESP_OK;
}

static void wifi_watch_neighbor_free(wifi_watch_neighbor_slot_t *pool)
{
    if (pool == NULL) return;
    esp32_mquickjs_memory_payload_free(pool);
    portENTER_CRITICAL(&s_neighbor_mux);
    s_neighbor_pool = NULL;
    s_neighbor_state = NEIGHBOR_NONE;
    portEXIT_CRITICAL(&s_neighbor_mux);
}

static void wifi_watch_neighbor_retire(void)
{
    wifi_watch_neighbor_slot_t *reap = NULL;
    portENTER_CRITICAL(&s_neighbor_mux);
    if (s_neighbor_state == NEIGHBOR_OPEN) {
        s_neighbor_state = NEIGHBOR_RETIRED;
        if (s_neighbor_active == 0) {
            s_neighbor_state = NEIGHBOR_REAPING;
            reap = s_neighbor_pool;
        }
    }
    portEXIT_CRITICAL(&s_neighbor_mux);
    wifi_watch_neighbor_free(reap);
}

static wifi_watch_neighbor_slot_t *wifi_watch_neighbor_acquire(void)
{
    wifi_watch_neighbor_slot_t *slot = NULL;
    portENTER_CRITICAL(&s_neighbor_mux);
    if (s_neighbor_state == NEIGHBOR_OPEN) {
        for (size_t i = 0; i < ESP32_MQUICKJS_WIFI_WATCH_NEIGHBOR_SLOTS; ++i) {
            if (s_neighbor_pool[i].refs == 0) {
                slot = &s_neighbor_pool[i];
                slot->refs = 1;
                ++s_neighbor_active;
                break;
            }
        }
    }
    portEXIT_CRITICAL(&s_neighbor_mux);
    return slot;
}

static void wifi_watch_neighbor_retain(wifi_watch_neighbor_slot_t *slot)
{
    if (slot == NULL) return;
    portENTER_CRITICAL(&s_neighbor_mux);
    ++slot->refs; /* Bounded by ingress + four queues/receivers + fanout. */
    portEXIT_CRITICAL(&s_neighbor_mux);
}

static void wifi_watch_neighbor_release(wifi_watch_neighbor_slot_t *slot)
{
    if (slot == NULL) return;
    wifi_watch_neighbor_slot_t *reap = NULL;
    portENTER_CRITICAL(&s_neighbor_mux);
    if (--slot->refs == 0) {
        --s_neighbor_active;
        if (s_neighbor_active == 0 && s_neighbor_state == NEIGHBOR_RETIRED) {
            s_neighbor_state = NEIGHBOR_REAPING;
            reap = s_neighbor_pool;
        }
    }
    portEXIT_CRITICAL(&s_neighbor_mux);
    wifi_watch_neighbor_free(reap);
}

static void wifi_watch_event_drop(void *opaque_event, void *opaque)
{
    (void)opaque;
    wifi_watch_event_t *event = opaque_event;
    if (event->id != WIFI_EVENT_STA_NEIGHBOR_REP) return;
    wifi_watch_neighbor_slot_t *slot = event->neighbor;
    event->neighbor = NULL;
    wifi_watch_neighbor_release(slot);
}

/* SDK esp_common.c copies report_len bytes, including the dialog token, into
 * the event-loop allocation. Validate every outer/inner TLV before reading it.
 * WLAN_EID_NEIGHBOR_REPORT=52, WNM_NEIGHBOR_BSS_TRANSITION_CANDIDATE=3 in the
 * pinned supplicant's ieee802_11_defs.h. Unknown TLVs are counted, not copied. */
static wifi_watch_data_result_t wifi_watch_neighbor_parse(
    wifi_watch_neighbor_slot_t *slot, const uint8_t *bytes, size_t length)
{
    if (length > ESP32_MQUICKJS_WIFI_WATCH_MAX_REPORT_BYTES) return WATCH_DATA_TOO_LARGE;
    if (bytes == NULL || length == 0) return WATCH_DATA_INVALID;
    slot->report_length = length;
    slot->dialog_token = bytes[0];
    slot->count = slot->skipped_elements = 0;
    size_t offset = 1;
    while (offset < length) {
        if (length - offset < 2) return WATCH_DATA_INVALID;
        uint8_t id = bytes[offset], size = bytes[offset + 1];
        offset += 2;
        if (size > length - offset) return WATCH_DATA_INVALID;
        const uint8_t *body = bytes + offset;
        offset += size;
        if (id != 52) { ++slot->skipped_elements; continue; }
        if (size < 13) return WATCH_DATA_INVALID;
        if (slot->count == ESP32_MQUICKJS_WIFI_WATCH_MAX_NEIGHBORS) return WATCH_DATA_TOO_LARGE;
        wifi_watch_neighbor_t *neighbor = &slot->neighbors[slot->count++];
        if (!esp32_mquickjs_wifi_neighbor_decode(neighbor, body, size)) return WATCH_DATA_INVALID;
    }
    return WATCH_DATA_OK;
}

static void wifi_watch_drop(void)
{
    uint32_t old = atomic_load(&s_ingress_dropped);
    while (old != UINT32_MAX && !atomic_compare_exchange_weak(&s_ingress_dropped, &old, old + 1U)) {}
}

static const wifi_watch_descriptor_t *wifi_watch_descriptor(int32_t id)
{
    for (size_t i = 0; i < sizeof(s_descriptors) / sizeof(s_descriptors[0]); ++i)
        if (s_descriptors[i].id == id) return &s_descriptors[i];
    return NULL;
}

void esp32_mquickjs_wifi_watch_capture(int32_t id, const void *data, uint32_t generation)
{
    if (s_watch_mutex == NULL) return;
    if (xSemaphoreTake(s_watch_mutex, 0) != pdTRUE) { wifi_watch_drop(); return; }
    if (s_ingress == NULL) goto done;
    if (s_sequence == WIFI_WATCH_MAX_SEQUENCE) { wifi_watch_drop(); goto done; }
    wifi_watch_event_t event = {.id = id, .sequence = ++s_sequence,
        .timestamp_us = esp_timer_get_time(), .control_generation = generation};
    const wifi_watch_descriptor_t *descriptor = wifi_watch_descriptor(id);
    wifi_watch_kind_t kind = descriptor == NULL ? WATCH_UNREVIEWED : descriptor->kind;
    event.has_data = kind == WATCH_EMPTY || (data != NULL && kind != WATCH_UNREVIEWED && kind != WATCH_SENSITIVE);
    if (kind == WATCH_NEIGHBOR) {
        bool interested = false;
        for (size_t i = 0; i < ESP32_MQUICKJS_WIFI_MAX_WATCHERS; ++i)
            if (s_sources[i] != NULL && (s_sources[i]->all ||
                (s_sources[i]->mask & (UINT64_C(1) << WIFI_EVENT_STA_NEIGHBOR_REP)))) interested = true;
        if (!interested) goto done;
        event.has_data = true; /* NULL is the SDK's no-report notification. */
        if (data != NULL) {
            const wifi_event_neighbor_report_t *report = data;
            if (report->report_len > ESP32_MQUICKJS_WIFI_WATCH_MAX_REPORT_BYTES)
                event.data_result = WATCH_DATA_TOO_LARGE;
            else if (report->report_len == 0) event.data_result = WATCH_DATA_INVALID;
            else if ((event.neighbor = wifi_watch_neighbor_acquire()) == NULL)
                event.data_result = WATCH_DATA_CAPACITY;
            else event.data_result = wifi_watch_neighbor_parse(event.neighbor, report->n_report, report->report_len);
            if (event.data_result != WATCH_DATA_OK) {
                event.has_data = false;
                wifi_watch_event_drop(&event, NULL);
            }
        }
    }
    if (data != NULL) switch (kind) {
    case WATCH_SCAN: {
        const wifi_event_sta_scan_done_t *v = data;
        event.a = v->status; event.b = v->number; event.c = v->scan_id; break;
    }
    case WATCH_CONNECTED: {
        const wifi_event_sta_connected_t *v = data;
        if (v->ssid_len > sizeof(event.ssid)) { event.has_data = false; break; }
        event.ssid_len = v->ssid_len; memcpy(event.ssid, v->ssid, v->ssid_len);
        memcpy(event.address, v->bssid, 6);
        event.a = v->channel; event.b = v->authmode; event.c = v->aid; break;
    }
    case WATCH_DISCONNECTED: {
        const wifi_event_sta_disconnected_t *v = data;
        if (v->ssid_len > sizeof(event.ssid)) { event.has_data = false; break; }
        event.ssid_len = v->ssid_len; memcpy(event.ssid, v->ssid, v->ssid_len);
        memcpy(event.address, v->bssid, 6); event.a = v->reason; event.b = v->rssi; break;
    }
    case WATCH_AUTH: {
        const wifi_event_sta_authmode_change_t *v = data;
        event.a = v->old_mode; event.b = v->new_mode; break;
    }
    case WATCH_AP_CONNECTED: {
        const wifi_event_ap_staconnected_t *v = data;
        memcpy(event.address, v->mac, 6); event.a = v->aid; event.b = v->is_mesh_child; break;
    }
    case WATCH_AP_DISCONNECTED: {
        const wifi_event_ap_stadisconnected_t *v = data;
        memcpy(event.address, v->mac, 6); event.a = v->aid; event.b = v->is_mesh_child;
        event.c = v->reason; break;
    }
    case WATCH_PROBE: {
        const wifi_event_ap_probe_req_rx_t *v = data;
        memcpy(event.address, v->mac, 6); event.a = v->rssi; break;
    }
    case WATCH_RSSI: event.a = ((const wifi_event_bss_rssi_low_t *)data)->rssi; break;
    case WATCH_CHANNEL: {
        const wifi_event_home_channel_change_t *v = data;
        event.a = v->old_chan; event.b = v->old_snd; event.c = v->new_chan; event.d = v->new_snd; break;
    }
    case WATCH_FTM: {
        const wifi_event_ftm_report_t *v = data;
        memcpy(event.address, v->peer_mac, 6); event.a = v->status;
        /* Failed measurements do not promise initialized/meaningful values.
         * This observer never consumes the SDK-owned detailed FTM report. */
        if (v->status == FTM_STATUS_SUCCESS) {
            event.unsigned_values[1] = v->rtt_raw;
            event.unsigned_values[2] = v->rtt_est;
            event.unsigned_values[3] = v->dist_est;
            event.count = v->ftm_report_num_entries;
        }
        break;
    }
    case WATCH_ACTION: {
        const wifi_event_action_tx_status_t *v = data;
        event.a = v->ifx; event.b = v->status; event.c = v->op_id; event.d = v->channel;
        break; /* context is an opaque native cookie; never copy/export it. */
    }
    case WATCH_ROC: {
        const wifi_event_roc_done_t *v = data;
        event.a = v->status; event.b = v->op_id; event.c = v->channel;
        break; /* No native context/pointer is copied into watch storage. */
    }
    case WATCH_WRONG_PASSWORD:
        memcpy(event.address, ((const wifi_event_ap_wrong_password_t *)data)->mac, 6);
        break;
    case WATCH_BEACON_OFFSET:
        event.value = ((const wifi_event_sta_beacon_offset_unstable_t *)data)->beacon_success_rate;
        if (!isfinite(event.value)) event.has_data = false;
        break;
    case WATCH_ITWT_SETUP: {
        const wifi_event_sta_itwt_setup_t *v = data;
        event.twt_setup.status = v->status;
        if (v->status == 1) { /* The pinned SDK documents 1, not ESP_OK. */
            event.twt_setup.target_wake_time = v->target_wake_time;
            event.twt_setup.setup_command = v->config.setup_cmd;
            event.twt_setup.trigger = v->config.trigger;
            event.twt_setup.flow_type = v->config.flow_type;
            event.twt_setup.id = v->config.flow_id;
            event.twt_setup.exponent = v->config.wake_invl_expn;
            event.twt_setup.unit = v->config.wake_duration_unit;
            event.twt_setup.duration = v->config.min_wake_dura;
            event.twt_setup.mantissa = v->config.wake_invl_mant;
            event.twt_setup.twt_id = v->config.twt_id;
            event.twt_setup.timeout_ms = v->config.timeout_time_ms;
        } else event.twt_setup.reason = v->reason;
        break;
    }
    case WATCH_BTWT_SETUP: {
        const wifi_event_sta_btwt_setup_t *v = data;
        event.twt_setup.status = v->status;
        if (v->status == BTWT_SETUP_SUCCESS) {
            event.twt_setup.target_wake_time = v->target_wake_time;
            event.twt_setup.setup_command = v->setup_cmd;
            event.twt_setup.trigger = v->trigger;
            event.twt_setup.flow_type = v->flow_type;
            event.twt_setup.id = v->btwt_id;
            event.twt_setup.exponent = v->wake_invl_expn;
            event.twt_setup.duration = v->min_wake_dura;
            event.twt_setup.mantissa = v->wake_invl_mant;
        } else if (v->status == BTWT_SETUP_TXFAIL) event.twt_setup.reason = v->reason;
        break;
    }
    case WATCH_ITWT_TEARDOWN: {
        const wifi_event_sta_itwt_teardown_t *v = data;
        event.a = v->status; event.b = v->flow_id; break;
    }
    case WATCH_BTWT_TEARDOWN: {
        const wifi_event_sta_btwt_teardown_t *v = data;
        event.a = v->status; event.b = v->btwt_id; break;
    }
    case WATCH_ITWT_PROBE: {
        const wifi_event_sta_itwt_probe_t *v = data;
        event.a = v->status;
        if (v->status != ITWT_PROBE_SUCCESS) event.b = v->reason;
        break;
    }
    case WATCH_ITWT_SUSPEND: {
        const wifi_event_sta_itwt_suspend_t *v = data;
        event.twt_suspend.status = v->status; event.twt_suspend.bitmap = v->flow_id_bitmap;
        for (size_t i = 0; i < 8; ++i)
            if ((v->flow_id_bitmap & (1U << i)) != 0) event.twt_suspend.duration_ms[i] = v->actual_suspend_time_ms[i];
        break;
    }
    case WATCH_TWT_WAKEUP: {
        const wifi_event_sta_twt_wakeup_t *v = data;
        event.a = v->twt_type; event.b = v->flow_id; break;
    }
    default: break; /* Never dereference unreviewed or sensitive payloads. */
    }
    if (xQueueSend(s_ingress, &event, 0) != pdTRUE) { wifi_watch_event_drop(&event, NULL); wifi_watch_drop(); goto done; }
    uint32_t queued = (uint32_t)uxQueueMessagesWaiting(s_ingress);
    if (queued > s_ingress_high_water) s_ingress_high_water = queued;
    for (size_t i = 0; i < ESP32_MQUICKJS_WIFI_MAX_WATCHERS; ++i)
        if (s_sources[i] != NULL) esp32_mquickjs_notify_activity(s_sources[i]->runtime);
done:
    xSemaphoreGive(s_watch_mutex);
}

static void wifi_watch_callback(void *arg, esp_event_base_t base, int32_t id, void *data)
{
    (void)arg; (void)base;
    if (!esp32_mquickjs_wifi_watch_controlled(id))
        esp32_mquickjs_wifi_watch_capture(id, data, 0);
}

static bool wifi_watch_poll(JSContext *ctx, esp32_mquickjs_runtime_t *runtime, void *opaque)
{
    (void)ctx; (void)opaque;
    bool handled = false;
    if (s_watch_mutex == NULL) return false;
    xSemaphoreTake(s_watch_mutex, portMAX_DELAY);
    for (size_t n = 0; s_ingress != NULL && n < ESP32_MQUICKJS_WIFI_WATCH_INGRESS_CAPACITY; ++n) {
        wifi_watch_event_t event;
        if (xQueuePeek(s_ingress, &event, 0) != pdTRUE) break;
        /* This poller runs on the runtime task after Future polling. A control
         * Future must leave its native registration before its observation can
         * become visible; no recursive Future polling and no queue dependency. */
        if (!esp32_mquickjs_wifi_watch_control_ready(event.id, event.control_generation)) break;
        (void)xQueueReceive(s_ingress, &event, 0);
        handled = true;
        for (size_t i = 0; i < ESP32_MQUICKJS_WIFI_MAX_WATCHERS; ++i) {
            wifi_watch_source_t *source = s_sources[i];
            if (source == NULL || source->runtime != runtime || event.sequence <= source->after_sequence) continue;
            if (!source->all && (event.id < 0 || event.id >= 64 || (source->mask & (UINT64_C(1) << event.id)) == 0)) continue;
            event.raw_requested = source->raw;
            wifi_watch_event_t copy = event;
            if (event.id == WIFI_EVENT_STA_NEIGHBOR_REP) wifi_watch_neighbor_retain(event.neighbor);
            if (!esp32_mquickjs_event_queue_send(source->queue, &copy)) wifi_watch_event_drop(&copy, NULL);
        }
        wifi_watch_event_drop(&event, NULL);
    }
    xSemaphoreGive(s_watch_mutex);
    return handled;
}

static bool wifi_watch_number(JSContext *ctx, JSValue *object, const char *key, int32_t number)
{
    return esp32_mquickjs_set_property_ref(ctx, object, key, JS_NewInt32(ctx, number));
}

