99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_watch.c
static bool wifi_watch_twt_setup_properties(JSContext *ctx, JSValue *data,
    const wifi_watch_event_t *event, bool individual)
{
    bool success = event->twt_setup.status == (individual ? 1 : BTWT_SETUP_SUCCESS);
    bool reason_valid = individual ? !success : event->twt_setup.status == BTWT_SETUP_TXFAIL;
    JSGCRef config_ref, time_ref;
    JSValue *config = JS_PushGCRef(ctx, &config_ref);
    JSValue *time = JS_PushGCRef(ctx, &time_ref);
    *config = *time = JS_NULL;
    bool ok = false;
    if (success) {
        *config = JS_NewObject(ctx);
        *time = JS_NewObject(ctx);
        if (JS_IsException(*config) || JS_IsException(*time) ||
            !wifi_watch_number(ctx, config, "setupCommandId", event->twt_setup.setup_command) ||
            !esp32_mquickjs_set_property_ref(ctx, config, "trigger", JS_NewBool(event->twt_setup.trigger)) ||
            !wifi_watch_number(ctx, config, "flowTypeId", event->twt_setup.flow_type) ||
            !wifi_watch_number(ctx, config, individual ? "flowId" : "broadcastId", event->twt_setup.id) ||
            !wifi_watch_number(ctx, config, "wakeIntervalExponent", event->twt_setup.exponent) ||
            !wifi_watch_number(ctx, config, "wakeIntervalMantissa", event->twt_setup.mantissa) ||
            !wifi_watch_number(ctx, config, "minimumWakeDuration", event->twt_setup.duration)) goto done;
        if (individual && (!wifi_watch_number(ctx, config, "wakeDurationUnitId", event->twt_setup.unit) ||
            !wifi_watch_number(ctx, config, "twtId", event->twt_setup.twt_id) ||
            !wifi_watch_number(ctx, config, "timeoutMs", event->twt_setup.timeout_ms))) goto done;
        if (!esp32_mquickjs_set_property_ref(ctx, time, "low", JS_NewUint32(ctx, (uint32_t)event->twt_setup.target_wake_time)) ||
            !esp32_mquickjs_set_property_ref(ctx, time, "high", JS_NewUint32(ctx, (uint32_t)(event->twt_setup.target_wake_time >> 32)))) goto done;
    }
    ok = wifi_watch_number(ctx, data, "statusId", event->twt_setup.status) &&
        esp32_mquickjs_set_property_ref(ctx, data, "reason", reason_valid ? JS_NewUint32(ctx, event->twt_setup.reason) : JS_NULL) &&
        esp32_mquickjs_set_property_ref(ctx, data, "configuration", *config) &&
        esp32_mquickjs_set_property_ref(ctx, data, "targetWakeTime", *time);
done:
    JS_PopGCRef(ctx, &time_ref);
    JS_PopGCRef(ctx, &config_ref);
    return ok;
}

static bool wifi_watch_twt_suspend_properties(JSContext *ctx, JSValue *data,
    const wifi_watch_event_t *event)
{
    JSGCRef times_ref;
    JSValue *times = JS_PushGCRef(ctx, &times_ref);
    *times = JS_NewArray(ctx, 0);
    bool ok = false;
    if (JS_IsException(*times)) goto done;
    for (uint32_t i = 0; i < 8; ++i) {
        JSValue value = (event->twt_suspend.bitmap & (1U << i)) != 0
            ? JS_NewUint32(ctx, event->twt_suspend.duration_ms[i]) : JS_NULL;
        if (JS_IsException(value) || JS_IsException(JS_SetPropertyUint32(ctx, *times, i, value))) goto done;
    }
    ok = wifi_watch_number(ctx, data, "statusId", event->twt_suspend.status) &&
        wifi_watch_number(ctx, data, "flowIdBitmap", event->twt_suspend.bitmap) &&
        esp32_mquickjs_set_property_ref(ctx, data, "actualSuspendTimeMs", *times);
done:
    JS_PopGCRef(ctx, &times_ref);
    return ok;
}

static bool wifi_watch_neighbor_properties(JSContext *ctx, JSValue *data,
    const wifi_watch_neighbor_slot_t *slot)
{
    JSGCRef list_ref, entry_ref;
    JSValue *list = JS_PushGCRef(ctx, &list_ref);
    JSValue *entry = JS_PushGCRef(ctx, &entry_ref);
    *list = JS_NewArray(ctx, 0);
    bool ok = false;
    if (JS_IsException(*list)) goto done;
    for (uint32_t i = 0; slot != NULL && i < slot->count; ++i) {
        const wifi_watch_neighbor_t *v = &slot->neighbors[i];
        char address[18];
        snprintf(address, sizeof(address), "%02x:%02x:%02x:%02x:%02x:%02x",
            v->bssid[0], v->bssid[1], v->bssid[2], v->bssid[3], v->bssid[4], v->bssid[5]);
        *entry = JS_NewObject(ctx);
        if (JS_IsException(*entry) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "bssid", JS_NewString(ctx, address)) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "bssidInformation", JS_NewUint32(ctx, v->bssid_information)) ||
            !wifi_watch_number(ctx, entry, "operatingClass", v->operating_class) ||
            !wifi_watch_number(ctx, entry, "channel", v->channel) ||
            !wifi_watch_number(ctx, entry, "phyTypeId", v->phy_type) ||
            !esp32_mquickjs_set_property_ref(ctx, entry, "candidatePreference", v->has_preference ? JS_NewUint32(ctx, v->preference) : JS_NULL) ||
            !wifi_watch_number(ctx, entry, "skippedSubelements", v->skipped_subelements) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *list, i, *entry))) goto done;
    }
    ok = esp32_mquickjs_set_property_ref(ctx, data, "received", JS_NewBool(slot != NULL)) &&
        wifi_watch_number(ctx, data, "reportLength", slot == NULL ? 0 : slot->report_length) &&
        esp32_mquickjs_set_property_ref(ctx, data, "dialogToken", slot == NULL ? JS_NULL : JS_NewUint32(ctx, slot->dialog_token)) &&
        wifi_watch_number(ctx, data, "skippedElements", slot == NULL ? 0 : slot->skipped_elements) &&
        esp32_mquickjs_set_property_ref(ctx, data, "neighbors", *list);
done:
    JS_PopGCRef(ctx, &entry_ref);
    JS_PopGCRef(ctx, &list_ref);
    return ok;
}

static JSValue wifi_watch_value_to_js(JSContext *ctx, const void *opaque_event, void *opaque)
{
    const wifi_watch_event_t *event = opaque_event;
    (void)opaque;
    const wifi_watch_descriptor_t *descriptor = wifi_watch_descriptor(event->id);
    wifi_watch_kind_t kind = descriptor == NULL ? WATCH_UNREVIEWED : descriptor->kind;
    const char *unavailable = kind == WATCH_SENSITIVE ? "sensitive" :
        kind == WATCH_UNREVIEWED ? "not-reviewed" :
        event->data_result == WATCH_DATA_CAPACITY ? "capacity" :
        event->data_result == WATCH_DATA_TOO_LARGE ? "too-large" : !event->has_data ? "unsupported-layout" : NULL;
    char address[18];
    snprintf(address, sizeof(address), "%02x:%02x:%02x:%02x:%02x:%02x",
        event->address[0], event->address[1], event->address[2], event->address[3], event->address[4], event->address[5]);
    JSGCRef result_ref, data_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *data = JS_PushGCRef(ctx, &data_ref);
    *result = JS_NewObject(ctx);
    *data = event->has_data ? JS_NewObject(ctx) : JS_NULL;
    if (JS_IsException(*result) || JS_IsException(*data)) goto fail;
    if (event->has_data) {
        if (kind == WATCH_CONNECTED || kind == WATCH_DISCONNECTED) {
            if (!esp32_mquickjs_wifi_set_ssid_properties(ctx, data, event->ssid, event->ssid_len) ||
                !esp32_mquickjs_set_property_ref(ctx, data, "bssid", JS_NewString(ctx, address))) goto fail;
        } else if (kind == WATCH_AP_CONNECTED || kind == WATCH_AP_DISCONNECTED || kind == WATCH_PROBE || kind == WATCH_WRONG_PASSWORD) {
            if (!esp32_mquickjs_set_property_ref(ctx, data, "address", JS_NewString(ctx, address))) goto fail;
        }
        bool ok = true;
        switch (kind) {
        case WATCH_NEIGHBOR:
            ok = wifi_watch_neighbor_properties(ctx, data, event->neighbor); break;
        case WATCH_SCAN:
            ok = esp32_mquickjs_set_property_ref(ctx, data, "status", JS_NewUint32(ctx, (uint32_t)event->a)) &&
                wifi_watch_number(ctx, data, "number", event->b) && wifi_watch_number(ctx, data, "scanId", event->c); break;
        case WATCH_CONNECTED:
            ok = wifi_watch_number(ctx, data, "channel", event->a) && wifi_watch_number(ctx, data, "authModeId", event->b) && wifi_watch_number(ctx, data, "aid", event->c); break;
        case WATCH_DISCONNECTED:
            ok = wifi_watch_number(ctx, data, "reason", event->a) && wifi_watch_number(ctx, data, "rssi", event->b); break;
        case WATCH_AUTH:
            ok = wifi_watch_number(ctx, data, "oldAuthModeId", event->a) && wifi_watch_number(ctx, data, "newAuthModeId", event->b); break;
        case WATCH_AP_CONNECTED: case WATCH_AP_DISCONNECTED:
            ok = wifi_watch_number(ctx, data, "aid", event->a) &&
                esp32_mquickjs_set_property_ref(ctx, data, "isMeshChild", JS_NewBool(event->b));
            if (ok && kind == WATCH_AP_DISCONNECTED) ok = wifi_watch_number(ctx, data, "reason", event->c);
            break;
        case WATCH_PROBE: case WATCH_RSSI: ok = wifi_watch_number(ctx, data, "rssi", event->a); break;
        case WATCH_CHANNEL:
            ok = wifi_watch_number(ctx, data, "oldChannel", event->a) && wifi_watch_number(ctx, data, "oldSecondaryChannelId", event->b) &&
                wifi_watch_number(ctx, data, "newChannel", event->c) && wifi_watch_number(ctx, data, "newSecondaryChannelId", event->d); break;
        case WATCH_FTM: {
            bool success = event->a == FTM_STATUS_SUCCESS;
            ok = esp32_mquickjs_set_property_ref(ctx, data, "peerAddress", JS_NewString(ctx, address)) &&
                wifi_watch_number(ctx, data, "statusId", event->a) &&
                esp32_mquickjs_set_property_ref(ctx, data, "rttRawNs", success ? JS_NewUint32(ctx, event->unsigned_values[1]) : JS_NULL) &&
                esp32_mquickjs_set_property_ref(ctx, data, "rttEstimatedNs", success ? JS_NewUint32(ctx, event->unsigned_values[2]) : JS_NULL) &&
                esp32_mquickjs_set_property_ref(ctx, data, "distanceCm", success ? JS_NewUint32(ctx, event->unsigned_values[3]) : JS_NULL) &&
                esp32_mquickjs_set_property_ref(ctx, data, "reportEntries", success ? JS_NewUint32(ctx, event->count) : JS_NULL);
            break;
        }
        case WATCH_ACTION:
            ok = wifi_watch_number(ctx, data, "interfaceId", event->a) && wifi_watch_number(ctx, data, "statusId", event->b) &&
                wifi_watch_number(ctx, data, "operationId", event->c) && wifi_watch_number(ctx, data, "channel", event->d);
            break;
        case WATCH_ROC:
            ok = wifi_watch_number(ctx, data, "statusId", event->a) && wifi_watch_number(ctx, data, "operationId", event->b) &&
                wifi_watch_number(ctx, data, "channel", event->c);
            break;
        case WATCH_BEACON_OFFSET:
            ok = esp32_mquickjs_set_property_ref(ctx, data, "beaconSuccessRate", JS_NewFloat64(ctx, event->value));
            break;
        case WATCH_ITWT_SETUP: case WATCH_BTWT_SETUP:
            ok = wifi_watch_twt_setup_properties(ctx, data, event, kind == WATCH_ITWT_SETUP); break;
        case WATCH_ITWT_TEARDOWN: case WATCH_BTWT_TEARDOWN:
            ok = wifi_watch_number(ctx, data, "statusId", event->a) &&
                wifi_watch_number(ctx, data, kind == WATCH_ITWT_TEARDOWN ? "flowId" : "broadcastId", event->b); break;
        case WATCH_ITWT_PROBE:
            ok = wifi_watch_number(ctx, data, "statusId", event->a) &&
                esp32_mquickjs_set_property_ref(ctx, data, "reason", event->a != ITWT_PROBE_SUCCESS ? JS_NewUint32(ctx, event->b) : JS_NULL); break;
        case WATCH_ITWT_SUSPEND:
            ok = wifi_watch_twt_suspend_properties(ctx, data, event); break;
        case WATCH_TWT_WAKEUP:
            ok = wifi_watch_number(ctx, data, "typeId", event->a) && wifi_watch_number(ctx, data, "flowId", event->b); break;
        default: break;
        }
        if (!ok) goto fail;
    }
    if (!esp32_mquickjs_set_property_ref(ctx, result, "sequence", JS_NewFloat64(ctx, event->sequence)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "timestampUs", JS_NewFloat64(ctx, event->timestamp_us)) ||
        !wifi_watch_number(ctx, result, "id", event->id) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "name", JS_NewString(ctx, descriptor == NULL ? "WIFI_EVENT_UNKNOWN" : descriptor->name)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "category", JS_NewString(ctx, descriptor == NULL ? "unknown" : descriptor->category)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "data", *data) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "dataUnavailableReason", unavailable == NULL ? JS_NULL : JS_NewString(ctx, unavailable))) goto fail;
    if (event->raw_requested && !esp32_mquickjs_set_property_ref(ctx, result, "rawEventDataUnavailableReason",
        JS_NewString(ctx, kind == WATCH_SENSITIVE ? "sensitive" : "not-reviewed"))) goto fail;
    JS_PopGCRef(ctx, &data_ref);
    return JS_PopGCRef(ctx, &result_ref);
fail:
    JS_PopGCRef(ctx, &data_ref);
    JS_PopGCRef(ctx, &result_ref);
    return JS_EXCEPTION;
}

