99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi/esp32_mquickjs_wifi_watch.c
static JSValue wifi_watch_to_js(JSContext *ctx, const void *opaque_event, void *opaque)
{
    JSValue value = wifi_watch_value_to_js(ctx, opaque_event, opaque);
    /* EventQueue marks finish before conversion, including OOM. It drops only
     * unconverted events. Consume our owned native reference in both outcomes. */
    wifi_watch_event_drop((void *)opaque_event, NULL);
    return value;
}

static void wifi_watch_closed(void *opaque)
{
    wifi_watch_source_t *source = opaque;
    xSemaphoreTake(s_watch_mutex, portMAX_DELAY);
    bool any = false;
    for (size_t i = 0; i < ESP32_MQUICKJS_WIFI_MAX_WATCHERS; ++i) {
        if (s_sources[i] == source) s_sources[i] = NULL;
        any = any || s_sources[i] != NULL;
    }
    if (!any) {
        if (s_ingress != NULL) {
            wifi_watch_event_t event;
            while (xQueueReceive(s_ingress, &event, 0) == pdTRUE) wifi_watch_event_drop(&event, NULL);
            esp32_mquickjs_memory_queue_delete(s_ingress);
            s_ingress = NULL;
        }
        wifi_watch_neighbor_retire();
    }
    xSemaphoreGive(s_watch_mutex);
    esp32_mquickjs_memory_payload_free(source);
}

void esp32_mquickjs_deinit_wifi_watch_runtime(void)
{
    if (s_watch_mutex == NULL) return;
    for (;;) {
        esp32_mquickjs_event_queue_t *queue = NULL;
        xSemaphoreTake(s_watch_mutex, portMAX_DELAY);
        for (size_t i = 0; i < ESP32_MQUICKJS_WIFI_MAX_WATCHERS; ++i)
            if (s_sources[i] != NULL) { queue = s_sources[i]->queue; break; }
        xSemaphoreGive(s_watch_mutex);
        if (queue == NULL) break;
        (void)esp32_mquickjs_event_queue_close(queue);
    }
}

void esp32_mquickjs_wifi_watch_reset_counters(void)
{
    if (s_watch_mutex != NULL) xSemaphoreTake(s_watch_mutex, portMAX_DELAY);
    atomic_store(&s_ingress_dropped, 0);
    s_ingress_high_water = s_ingress == NULL ? 0 : (uint32_t)uxQueueMessagesWaiting(s_ingress);
    if (s_watch_mutex != NULL) xSemaphoreGive(s_watch_mutex);
}

JSValue esp32_mquickjs_wifi_watch_status(JSContext *ctx)
{
    uint32_t count = 0, queued = 0, high_water = 0;
    bool exhausted = false;
    if (s_watch_mutex != NULL) {
        xSemaphoreTake(s_watch_mutex, portMAX_DELAY);
        for (size_t i = 0; i < ESP32_MQUICKJS_WIFI_MAX_WATCHERS; ++i) count += s_sources[i] != NULL;
        if (s_ingress != NULL) queued = uxQueueMessagesWaiting(s_ingress);
        high_water = s_ingress_high_water;
        exhausted = s_sequence == WIFI_WATCH_MAX_SEQUENCE;
        xSemaphoreGive(s_watch_mutex);
    }
    portENTER_CRITICAL(&s_neighbor_mux);
    uint32_t active = s_neighbor_active;
    bool allocated = s_neighbor_state != NEIGHBOR_NONE;
    bool retired = s_neighbor_state == NEIGHBOR_RETIRED || s_neighbor_state == NEIGHBOR_REAPING;
    portEXIT_CRITICAL(&s_neighbor_mux);
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) || !wifi_watch_number(ctx, result, "subscribers", count) ||
        !wifi_watch_number(ctx, result, "ingressQueued", queued) ||
        !wifi_watch_number(ctx, result, "ingressHighWater", high_water) ||
        !wifi_watch_number(ctx, result, "neighborSlotsUsed", active) ||
        !wifi_watch_number(ctx, result, "neighborPoolBytes", allocated ? ESP32_MQUICKJS_WIFI_WATCH_NEIGHBOR_SLOTS * sizeof(wifi_watch_neighbor_slot_t) : 0) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "neighborPoolRetired", JS_NewBool(retired)) ||
        !wifi_watch_number(ctx, result, "ingressCapacity", ESP32_MQUICKJS_WIFI_WATCH_INGRESS_CAPACITY) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "ingressDropped", JS_NewUint32(ctx, atomic_load(&s_ingress_dropped))) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "sequenceExhausted", JS_NewBool(exhausted))) {
        JS_PopGCRef(ctx, &result_ref); return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

/* Capture options before registering callbacks or allocating native queues.
 * A scoped subscription never enables raw export or widens "all" to other modules. */
static bool wifi_watch_options(JSContext *ctx, int argc, JSValue *argv,
    const char *operation, bool scoped, uint64_t allowed_mask,
    wifi_watch_source_t *out, uint32_t *out_capacity)
{
    static const char *const keys[] = {"events", "capacity", "overflow", "includeRawEventData"};
    static const char *const overflow[] = {"drop-newest"};
    static const char *const all[] = {"all"};
    uint32_t capacity = 16;
    wifi_watch_source_t parsed = {.all = !scoped, .mask = scoped ? allowed_mask : 0};
    JSGCRef options_ref, value_ref, item_ref;
    JSValue *options = JS_PushGCRef(ctx, &options_ref);
    JSValue *value = JS_PushGCRef(ctx, &value_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    if (argc > 1) { JS_ThrowTypeError(ctx, "%s() takes at most one options object", operation); goto fail; }
    *options = argc == 1 ? argv[0] : JS_UNDEFINED;
    if (!JS_IsUndefined(*options)) {
        if (!esp32_mquickjs_validate_plain_options(ctx, *options, operation, keys, scoped ? 3 : sizeof(keys) / sizeof(keys[0]))) goto fail;
        *value = JS_GetPropertyStr(ctx, *options, "capacity");
        if (JS_IsException(*value)) goto fail;
        if (!JS_IsUndefined(*value) && !esp32_mquickjs_value_to_bounded_u32(ctx, *value, 1, ESP32_MQUICKJS_WIFI_MAX_WATCH_CAPACITY, &capacity)) goto invalid;
        if (!scoped) {
            *value = JS_GetPropertyStr(ctx, *options, "includeRawEventData");
            if (JS_IsException(*value)) goto fail;
            if (!JS_IsUndefined(*value)) { if (!JS_IsBool(*value)) goto invalid; parsed.raw = *value == JS_TRUE; }
        }
        size_t index;
        *value = JS_GetPropertyStr(ctx, *options, "overflow");
        if (JS_IsException(*value)) goto fail;
        if (!JS_IsUndefined(*value) && !esp32_mquickjs_value_to_enum(ctx, *value, overflow, 1, &index)) goto invalid;
        *value = JS_GetPropertyStr(ctx, *options, "events");
        if (JS_IsException(*value)) goto fail;
        if (!JS_IsUndefined(*value)) {
            if (JS_IsString(ctx, *value)) {
                if (!esp32_mquickjs_value_to_enum(ctx, *value, all, 1, &index)) goto invalid;
            } else {
                if (!JS_IsArray(ctx, *value)) goto invalid;
                *item = JS_GetPropertyStr(ctx, *value, "length");
                uint32_t length;
                if (JS_IsException(*item)) goto fail;
                if (!esp32_mquickjs_value_to_bounded_u32(ctx, *item, 1, WIFI_EVENT_MAX, &length)) goto invalid;
                parsed.all = false;
                parsed.mask = 0;
                for (uint32_t i = 0; i < length; ++i) {
                    *item = JS_GetPropertyUint32(ctx, *value, i);
                    if (JS_IsException(*item)) goto fail;
                    JSCStringBuf buffer; size_t len;
                    if (!JS_IsString(ctx, *item)) goto invalid;
                    const char *text = JS_ToCStringLen(ctx, &len, *item, &buffer);
                    if (text == NULL) goto fail;
                    const wifi_watch_descriptor_t *match = NULL;
                    for (size_t n = 0; n < sizeof(s_descriptors) / sizeof(s_descriptors[0]); ++n)
                        if (strlen(s_descriptors[n].name) == len && memcmp(text, s_descriptors[n].name, len) == 0) { match = &s_descriptors[n]; break; }
                    if (match == NULL || match->id < 0 || match->id >= 64 ||
                        (scoped && !(allowed_mask & (UINT64_C(1) << match->id))) || (parsed.mask & (UINT64_C(1) << match->id)) != 0) goto invalid;
                    parsed.mask |= UINT64_C(1) << match->id;
                }
            }
        }
    }
    *out = parsed;
    *out_capacity = capacity;
    JS_PopGCRef(ctx, &item_ref); JS_PopGCRef(ctx, &value_ref); JS_PopGCRef(ctx, &options_ref);
    return true;
invalid:
    if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "invalid %s options", operation);
fail:
    JS_PopGCRef(ctx, &item_ref); JS_PopGCRef(ctx, &value_ref); JS_PopGCRef(ctx, &options_ref);
    return false;
}

static JSValue wifi_watch_open(JSContext *ctx, int argc, JSValue *argv,
    const char *operation, bool scoped, uint64_t allowed_mask)
{
    wifi_watch_source_t parsed;
    uint32_t capacity;
    if (!wifi_watch_options(ctx, argc, argv, operation, scoped, allowed_mask, &parsed, &capacity))
        return JS_EXCEPTION;
    JSGCRef queue_ref;
    JSValue *queue = JS_PushGCRef(ctx, &queue_ref);
    parsed.runtime = esp32_mquickjs_get_active_runtime();
    if (parsed.runtime == NULL) { JS_ThrowInternalError(ctx, "%s requires an active runtime", operation); goto fail; }
    /* Runtime task owns initialization and all source mutations; callback only
     * tries the already published static mutex. Never hold it across JS GC. */
    if (s_watch_mutex == NULL) s_watch_mutex = xSemaphoreCreateMutexStatic(&s_watch_mutex_storage);
    xSemaphoreTake(s_watch_mutex, portMAX_DELAY);
    size_t slot;
    for (slot = 0; slot < ESP32_MQUICKJS_WIFI_MAX_WATCHERS; ++slot) if (s_sources[slot] == NULL) break;
    bool exhausted = s_sequence == WIFI_WATCH_MAX_SEQUENCE;
    xSemaphoreGive(s_watch_mutex);
    if (slot == ESP32_MQUICKJS_WIFI_MAX_WATCHERS || exhausted) { JS_ThrowInternalError(ctx, "%s capacity or sequence exhausted", operation); goto fail; }
    esp_err_t err = esp_event_loop_create_default();
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) goto native_fail;
    if (s_watch_instance == NULL) {
        err = esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID, wifi_watch_callback, NULL, &s_watch_instance);
        if (err != ESP_OK) goto native_fail;
    }
    if (!esp32_mquickjs_register_async_poller(parsed.runtime, wifi_watch_poll, NULL)) { JS_ThrowInternalError(ctx, "%s poller capacity exhausted", operation); goto fail; }
    wifi_watch_source_t *source = esp32_mquickjs_memory_wireless_alloc("wifi", sizeof(*source), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (source == NULL) { JS_ThrowOutOfMemory(ctx); goto fail; }
    *source = parsed;
    *queue = esp32_mquickjs_event_queue_new_wireless("wifi", ctx, parsed.runtime, sizeof(wifi_watch_event_t), capacity,
        ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST, wifi_watch_to_js, wifi_watch_event_drop, wifi_watch_closed, source);
    if (JS_IsException(*queue)) { esp32_mquickjs_memory_payload_free(source); goto fail; }
    source->queue = esp32_mquickjs_event_queue_from_value(ctx, *queue);
    xSemaphoreTake(s_watch_mutex, portMAX_DELAY);
    if (s_ingress == NULL) s_ingress = esp32_mquickjs_memory_queue_create("wifi", ESP32_MQUICKJS_WIFI_WATCH_INGRESS_CAPACITY, sizeof(wifi_watch_event_t), false);
    if (s_ingress == NULL) {
        xSemaphoreGive(s_watch_mutex);
        esp32_mquickjs_event_queue_dispose(ctx, *queue);
        JS_ThrowOutOfMemory(ctx); goto fail;
    }
    if (source->all || (source->mask & (UINT64_C(1) << WIFI_EVENT_STA_NEIGHBOR_REP))) {
        err = wifi_watch_neighbor_open();
        if (err != ESP_OK) {
            xSemaphoreGive(s_watch_mutex);
            esp32_mquickjs_event_queue_dispose(ctx, *queue);
            if (err == ESP_ERR_NO_MEM) { JS_ThrowOutOfMemory(ctx); goto fail; }
            goto native_fail; /* Old queue/receiver still owns the sole pool. */
        }
    }
    source->after_sequence = s_sequence;
    s_sources[slot] = source;
    xSemaphoreGive(s_watch_mutex);
    JSValue result = JS_PopGCRef(ctx, &queue_ref);
    return result;
native_fail:
    esp32_mquickjs_wifi_throw_operation_error(ctx, "WIFI_WATCH_FAILED", operation, err, -1, UINT32_MAX);
fail:
    JS_PopGCRef(ctx, &queue_ref);
    return JS_EXCEPTION;
}

JSValue js_wifi_watch(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return wifi_watch_open(ctx, argc, argv, "wifi.watch", false, 0);
}

#if CONFIG_ESP_WIFI_RRM_SUPPORT || CONFIG_ESP_WIFI_WNM_SUPPORT || CONFIG_ESP_WIFI_11R_SUPPORT
static uint64_t wifi_roaming_watch_mask(void)
{
    /* Public SDK observations only; none proves BTM acceptance or completed roaming. */
    return (UINT64_C(1) << WIFI_EVENT_STA_START)
        | (UINT64_C(1) << WIFI_EVENT_STA_STOP)
        | (UINT64_C(1) << WIFI_EVENT_STA_CONNECTED)
        | (UINT64_C(1) << WIFI_EVENT_STA_DISCONNECTED)
        | (UINT64_C(1) << WIFI_EVENT_STA_AUTHMODE_CHANGE)
        | (UINT64_C(1) << WIFI_EVENT_STA_BSS_RSSI_LOW)
        | (UINT64_C(1) << WIFI_EVENT_STA_BEACON_TIMEOUT)
        | (UINT64_C(1) << WIFI_EVENT_HOME_CHANNEL_CHANGE)
#if CONFIG_ESP_WIFI_RRM_SUPPORT
        | (UINT64_C(1) << WIFI_EVENT_STA_NEIGHBOR_REP)
#endif
        | (UINT64_C(1) << WIFI_EVENT_STA_BEACON_OFFSET_UNSTABLE);
}

JSValue js_wifi_roaming_watch(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    return wifi_watch_open(ctx, argc, argv, "wifi.roaming.watch", true, wifi_roaming_watch_mask());
}
#endif
#endif
